{"content":"<h1 id=\"mambascript\">MambaScript</h1>\n<h2 id=\"gettingstarted\">Getting Started</h2>\n<pre><code class=\"bash language-bash\">$ npm install -g mambascript\n</code></pre>\n<h2 id=\"whatismambascript\">What is MambaScript</h2>\n<p>MambaScript is a high level programming language that compiles to ES5 JavaScript. MambaScript attempts\nto be incredibly readable and simple and thus makes it a perfect language for beginners. The language is\nmade with 3 people in mind. First the freelancer that is worried about being super productive and also needs to be\nable to come back to their code a couple years later and easily understand what they were trying to do. Second the\nnew programmer who has trouble understanding what the heck their code means when they type it, the readability of\nMambaScript is exquisite and it is incredibly easy to write and explain. Third me, I longed for a language that was readable\nlike Python or Ruby, flexible like JavaScript, Typing like JS but also used keywords and syntax that look like regular\neveryday language. I couldn't find it so I searched and found different tools that I could use to put together and make one\nfor myself and grow the language. And here we are today.</p>\n<h2 id=\"whymambascript\">Why MambaScript</h2>\n<p>Because it's cool it's fun and the name MambaScript embodies what I want to do here the most.\nLike a python, a mamba is a type of snake, one of the big deals in this language is to strongly force you to\nbe strict with your indentations, it makes your code cleaner and far more readable. The Script obviously comes from\nit being a scripting language like JS and of course the idea of Mamba Mentality. When I made the plunge to decide to make\ncoding, (which had been a hobby of mine), my fulltime job, I was poor by any numerical way of figuring out what poor meant, but I had one thing and that was my mindset, and my Mentality and I never let my mind think it was poor, no matter how hard\nI had to grind I never let myself have <code>imposter syndrome</code> and I never let the sun come up a day without practicing my craft. To me that's the Mamba Mentality, and I like to think that that's in me. RIP Kobe.</p>","data":{"title":"Start Here On Your MambaScript Journey","subTitle":"What is MambaScript & Why MambaScript","excerpt":"I want to be the best. I want to be the best simple and plain, thats what drives me - Kobe Bryant","featureImage":"/img/mamba.gif","date":"10/31/21"},"isEmpty":false,"excerpt":"","path":"/Users/bigpoppacode/code/app_projects/mambascript.org/api-pillar/start-here.md","_id":"start-here"}